app/views/posts/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
        <table class="comments-table">
          <% post.comments.each do |comment| %>