app/controllers/comments_controller.rb

  def create
    comment = Post.find(params[:post_id]).comments.new(comment_params)
    msg = comment.save ? 'Comment saved' : 'Unable to save comment: ' + comment.errors.full_messages.join('. ')
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "author", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "cau"], ["author", "Jozef"], ["post_id", 1], ["created_at", "2015-11-16 18:07:20.197343"], ["updated_at", "2015-11-16 18:07:20.197343"]]

  def destroy
    Post.find(params[:post_id]).comments.find(params[:id]).destroy
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT 1  [["post_id", 1], ["id", 3]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]